In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine,text
import getpass

In [2]:
password = getpass.getpass()
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

 ········

Engine(mysql+pymysql://root:***@localhost/sakila)

In [8]:
# Write a Python function called rentals_month that retrieves rental data for a given month and year 
# from the Sakila database as a Pandas DataFrame. 
#The function should take in three parameters:
        # ◦ engine: an object representing the database connection engine to be used to establish a connection to the Sakila database. 
        # ◦ month: an integer representing the month for which rental data is to be retrieved. 
        # ◦ year: an integer representing the year for which rental data is to be retrieved. 
# The function should execute a SQL query to retrieve the rental data for the specified month and year
#from the rental table in the Sakila database, and return it as a pandas DataFrame.
def rentals_month(engine, year, month):
    
    with engine.connect() as connection:
        query = text(
            f'''
            SELECT *
            FROM rental
            WHERE YEAR(rental_date) = {year} AND
            MONTH(rental_date) = {month};
            '''
        )
        
        result = connection.execute(query)
        df = pd.DataFrame(result.all())
    return df
rentals_month(engine, 2005, 5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [73]:
# Develop a Python function called rental_count_month that takes the DataFrame provided 
# by rentals_month as input along with the month and year 
# and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

def rental_count_month(engine,month,year):
    df = rentals_month(engine, month=month, year=year)
    result = df.groupby(['customer_id'])['rental_id'].count().reset_index()
    result = result.rename(columns={'rental_id': f'rental_count_{month:02d}_{year}'}) 
    return result.set_index('customer_id')

In [74]:
rental_count_month(engine,5,2005)

             rental_count_05_2005
customer_id
1                               2
2                               1
3                               2
5                               3
6                               3
...                           ...
594                             4
595                             1
596                             6
597                             2
599                             1

[520 rows x 1 columns]

In [93]:
# Create a Python function called compare_rentals that takes two DataFrames as input 
# containing the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.
def compare_rentals(df,df2):
    assert df.index.name == 'customer_id' and df2.index.name == 'customer_id'
    
    compare_dfs = df.join(df2, how='inner')
    compare_dfs['difference']= compare_dfs.iloc[:, 0] - compare_dfs.iloc[:, 1]
    return compare_dfs

In [94]:
compare_rentals(rental_count_month(engine,5,2005), rental_count_month(engine,6,2005))

             rental_count_05_2005  rental_count_06_2005  difference
customer_id
1                               2                     7          -5
2                               1                     1           0
3                               2                     4          -2
5                               3                     5          -2
6                               3                     4          -1
...                           ...                   ...         ...
594                             4                     6          -2
595                             1                     2          -1
596                             6                     2           4
597                             2                     3          -1
599                             1                     4          -3

[512 rows x 3 columns]